In [1]:
X = [["c", "2000", 10],["c", "2000", 20],["c", "2001", 10],["a", "2000", 10],["a", "2000", 10],["a", "2002", 10]]

In [2]:
import pandas as pd
df = pd.DataFrame(X, columns = ["category", "year", "sub"])

In [3]:
df

  category  year  sub
0        c  2000   10
1        c  2000   20
2        c  2001   10
3        a  2000   10
4        a  2000   10
5        a  2002   10

In [11]:
grouped = df.groupby(["category", "year"]).sum()

In [12]:
grouped

               sub
category year
a        2000   20
         2002   10
c        2000   30
         2001   10